Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/case_studies/case_study_taking_parental_leave.html.txt.tmx
Source language: en
Languages: ga

source: Case study: Taking parental leave
ga: Cás-staidéar: saoire thuismitheoirí a thógáil

source: John and Mary want to take parental leave in respect of their son Michael, who is 5 years old
ga: Is mian le John agus Mary saoire thuismitheoirí a thógáil maidir lena mac Michael, atá 5

source: John has been working for his employer for 9 months and wants to take the leave in 2 months' time
ga: Tá John ag obair dá fhostóir le 9 mí anuas agus is mian leis an saoire a thógáil i gceann 2 mhí

source: The employer has told John that he cannot spare him at this time and anyway, he is not entitled to parental leave as he hasn't been working for him for a year
ga: Tá sé ráite ag an bhfostóir le John nach féidir é a spáráil ag an am seo agus ar chaoi ar bith, nach bhfuil sé i dteideal do shaoire thuismitheoirí toisc nach bhfuil sé ag obair dó fós ar feadh bliana

source: John's employer is correct about the length of service
ga: Tá fostóir John ceart faoin tréimhse seirbhíse

source: After 3 months' service, an employee is entitled to reduced parental leave if the child is nearing the upper age limit
ga: I ndiaidh trí mhí seirbhíse, tá John i dteideal saoire thuismitheoirí laghdaithe má tá an leanbh ag druidim i dtreo aois an uasteorainn

source: Since the child will not be 8 for another 3 years however, this will not apply to John's claim
ga: Cibé ar bith, os rud é nach mbeidh an leanbh 8 ar feadh 3 bliana eile, ní bhainfidh sé seo le hiarratas John

source: John should consider taking his leave when he has one year's service
ga: Ba chóir do John smaoineamh faoin saoire thuismitheoirí a thógáil nuair atá bliain amháin seirbhíse aige

source: John's employer could postpone the leave then on the grounds of for example, the nature of John's duties
ga: D'fhéadfadh fostóir John ansin an saoire a chuir siar ar chúiseanna áirithe, mar shampla, nádúr na ndualgas atá ag John

source: Unless John is involved in work with a seasonal variation however, the leave could only be postponed once for up to 6 months
ga: Cibé ar bith, mura bhfuil John bainteach le hobair ina mbíonn athrú séasúrach, ní féidir an saoire a chuir siar ach uair amháin suas chomh fada le 6 mhí

source: Mary has been with her employer for 15 months
ga: Tá Mary ag obair lena fostóir ar feadh 15 mí

source: Her employer says that parental leave is only for emergencies and in any case, it doesn't apply if the employee has already had 18 weeks' maternity leave
ga: Deir a fostóir go mbaineann saoire thuismitheoirí le cásanna éigeandála amháin agus ar chaoi ar bith, ní bhaineann sí má tá saoire mháithreachais de 18 seachtainí cheana féin tógtha ag an bhfostaí

source: No, Mary's employer is mistaken
ga: Níl, tá fostóir Mary mícheart

source: Parental leave is not confined to emergency situations and the only stipulation is that the parent uses the leave to care for the child
ga: Níl saoire thuismitheoirí srianta do chásanna éigeandála agus an coinníoll amháin atá i gceist ná go n-úsáideann an tuismitheoir an saoire chun cúram a thabhairt dá leanbh

source: Mary's employer may be confusing parental leave with force majeure leave
ga: D'fhéadfadh go bhfuil fostóir Mary measctha suas idir saoire thuismitheoirí agus saoire force majeure

source: Furthermore, the fact that Mary took maternity leave does not affect parental leave as they are completely separate types of leave set down by different laws
ga: Ina theannta sin, níl aon éifeacht ag an saoire mháithreachais a thóg Mary ar a saoire thuismitheoirí, toisc gur cineálacha saoire go hiomlán ar leith iad, atá leagtha síos ag dlithe difriúla

source: As a first step, Mary should give her employer at least 6 weeks' written notice of her intention to take parental leave, the starting date and duration
ga: Mar thús, ba chóir do Mary ar a laghad 6 seachtainí fógra scríofa a thabhairt dá fostóir ag cur in iúl go bhfuil sé ar intinn aici saoire thuismitheoirí a thógáil, mar aon leis an dáta tosaigh agus fad an tsaoire

source: Mary should keep a copy of this notice
ga: Ba chóir do Mary cóip den bhfógra seo a choinneáil

source: If she has continuing difficulties with her employer, Mary should make a complaint to the Workplace Relations Commission using the online complaint form available on workplacerelations.ie
ga: Má tá deacrachtaí leanúnacha aici lena fostóir, ba chóir do Mary gearáin a chur faoi bhráid an Choimisiúin um Chaidreamh san Áit Oibre tríd an fhoirm ghearáin ar líne a úsáid á fáil ar workplacerelations.ie
